# 事件相机参数
HEIGHT = 264
WIDTH = 320
PACKET_NUM = 5  # 一帧图像所包含timestamp的个数
FPS = 40  # 帧率

# 音乐参数
OCTAVE_NUM = 2  # 用几个八度的音，默认为2 (目前仅支持2)
SCALE_TYPE = 'Major'  # 音阶的类，默认为大调 （目前仅支持大调）
ROOT_PITCH = 48  # 每个音阶的起始音符，默认为C3
EVENT_NUM_THRESHOLD = 20  # 一个高度范围内能够触发音符所需的事件数
TOTAL_EVENT_THRESHOLD = 40 * PACKET_NUM  # 一张图内总噪声事件数，低于该值证明该帧图像全为噪声

# 以下为事件高度差所对应的音高
PITCH_MAJOR = [
    [0],
    [0],
    [0],
    [0],
    [0, 4],
    [0, 4],
    [0, 4],
    [0, 4, 7],
    [0, 4, 7],
    [0, 4, 7],
    [0, 4, 7],
    [0, 4, 7, 11],
    [0, 4, 7, 11],
    [0, 4, 7, 11],
    [0, 4, 7, 11, 14],
    [0, 4, 7, 11, 14],
    [0, 4, 7, 11, 14],
    [0, 4, 7, 11, 14, 17],
    [0, 4, 7, 11, 14, 17],
    [0, 4, 7, 11, 14, 17],
    [0, 4, 7, 11, 14, 17],
    [0, 4, 7, 11, 14, 17, 21],
    [0, 4, 7, 11, 14, 17, 21],
    [0, 4, 7, 11, 14, 17, 21],
]
